podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/PCC_S32K142.svd.xml
<!--
Devices using this peripheral: 
      S32K142
-->
      <peripheral>
         <?sourceFile "PCC_S32K142" ?>
         <name>PCC</name>
         <description>Peripheral Clock Controller</description>
         <groupName>PCC</groupName>
         <headerStructName>PCC</headerStructName>
         <baseAddress>0x40065000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x200</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <dim>128</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114,115,116,117,118,119,120,121,122,123,124,125,126,127</dimIndex>
               <name>PCCn%s</name>
               <?hide?>
               <description>PCC Register</description>
               <addressOffset>0x0</addressOffset>
               <resetValue>0x80000000</resetValue>
               <fields>
                  <field>
                     <name>PCD</name>
                     <description>Peripheral Clock Divider Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>XXXX</name>
                           <description>Divide by N+1</description>
                           <isDefault>true</isDefault>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FRAC</name>
                     <description>Peripheral Clock Divider Fraction</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>X</name>
                           <description>Fractional value N+1</description>
                           <isDefault>true</isDefault>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PCS</name>
                     <description>Peripheral Clock Source Select</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Clock is off.\t An external clock may be enabled for this peripheral</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>OSCCLK - System Oscillator Bus Clock(scg_sosc_slow_clk)</description>
                           <value>0b001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>SCGIRCLK - Slow IRC Clock(scg_sirc_slow_clk), (maximum is 8MHz)</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3</name>
                           <description>SCGFIRCLK - Fast IRC Clock(scg_firc_slow_clk), (maximum is 48MHz)</description>
                           <value>0b011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>5</name>
                           <description>SCGFLLCLK System FLL clock(scg_sfll_slow_clk)</description>
                           <value>0b101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>6</name>
                           <description>SCGPLLCLK System PLL clock(scg_spll_slow_clk)</description>
                           <value>0b110</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CGC</name>
                     <description>Clock Gate Control</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Clock disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Clock enabled.\t The current clock selection and divider options are locked</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PR</name>
                     <description>Peripheral Present</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Peripheral is not present</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Peripheral is present</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>PCC_FTFC</name>
               <description>PCC FTFC Register</description>
               <addressOffset>0x80</addressOffset>
               <resetValue>0xC0000000</resetValue>
               <fields>
                  <field>
                     <name>CGC</name>
                     <description>Clock Gate Control</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Clock disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Clock enabled.\t The current clock selection and divider options are locked</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PR</name>
                     <description>Peripheral Present</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Peripheral is not present</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Peripheral is present</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register derivedFrom="PCC_FTFC"> <name>PCC_DMAMUX</name> <description>PCC DMAMUX Register</description> <addressOffset>0x84</addressOffset> <resetValue>0x80000000</resetValue> </register>
            <register derivedFrom="PCC_FTFC"> <name>PCC_FlexCAN0</name> <description>PCC FlexCAN0 Register</description> <addressOffset>0x90</addressOffset> <resetValue>0x80000000</resetValue> </register>
            <register derivedFrom="PCC_FTFC"> <name>PCC_FlexCAN1</name> <description>PCC FlexCAN1 Register</description> <addressOffset>0x94</addressOffset> <resetValue>0x80000000</resetValue> </register>
            <register>
               <name>PCC_FTM3</name>
               <description>PCC FTM3 Register</description>
               <addressOffset>0x98</addressOffset>
               <resetValue>0x80000000</resetValue>
               <fields>
                  <field>
                     <name>PCS</name>
                     <description>Peripheral Clock Source Select</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Clock is off.\t An external clock may be enabled for this peripheral</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>OSCCLK - System Oscillator Bus Clock(scg_sosc_slow_clk)</description>
                           <value>0b001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>SCGIRCLK - Slow IRC Clock(scg_sirc_slow_clk), (maximum is 8MHz)</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3</name>
                           <description>SCGFIRCLK - Fast IRC Clock(scg_firc_slow_clk), (maximum is 48MHz)</description>
                           <value>0b011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>5</name>
                           <description>SCGFPCLK System FLL clock(scg_sfll_slow_clk)</description>
                           <value>0b101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>6</name>
                           <description>SCGPLLCLK System PLL clock(scg_spll_slow_clk)</description>
                           <value>0b110</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CGC</name>
                     <description>Clock Gate Control</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Clock disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Clock enabled.\t The current clock selection and divider options are locked</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PR</name>
                     <description>Peripheral Present</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Peripheral is not present</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Peripheral is present</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register derivedFrom="PCC_FTM3"> <name>PCC_ADC1</name> <description>PCC ADC1 Register</description> <addressOffset>0x9C</addressOffset> </register>
            <register derivedFrom="PCC_FTM3"> <name>PCC_LPSPI0</name> <description>PCC LPSPI0 Register</description> <addressOffset>0xB0</addressOffset> </register>
            <register derivedFrom="PCC_FTM3"> <name>PCC_LPSPI1</name> <description>PCC LPSPI1 Register</description> <addressOffset>0xB4</addressOffset> </register>
            <register derivedFrom="PCC_FTFC"> <name>PCC_PDB1</name> <description>PCC PDB1 Register</description> <addressOffset>0xC4</addressOffset> <resetValue>0x80000000</resetValue> </register>
            <register derivedFrom="PCC_FTFC"> <name>PCC_CRC</name> <description>PCC CRC Register</description> <addressOffset>0xC8</addressOffset> <resetValue>0x80000000</resetValue> </register>
            <register derivedFrom="PCC_FTFC"> <name>PCC_PDB0</name> <description>PCC PDB0 Register</description> <addressOffset>0xD8</addressOffset> <resetValue>0x80000000</resetValue> </register>
            <register derivedFrom="PCC_FTM3"> <name>PCC_LPIT</name> <description>PCC LPIT Register</description> <addressOffset>0xDC</addressOffset> </register>
            <register derivedFrom="PCC_FTM3"> <name>PCC_FTM0</name> <description>PCC FTM0 Register</description> <addressOffset>0xE0</addressOffset> </register>
            <register derivedFrom="PCC_FTM3"> <name>PCC_FTM1</name> <description>PCC FTM1 Register</description> <addressOffset>0xE4</addressOffset> </register>
            <register derivedFrom="PCC_FTM3"> <name>PCC_FTM2</name> <description>PCC FTM2 Register</description> <addressOffset>0xE8</addressOffset> </register>
            <register derivedFrom="PCC_FTM3"> <name>PCC_ADC0</name> <description>PCC ADC0 Register</description> <addressOffset>0xEC</addressOffset> </register>
            <register derivedFrom="PCC_FTFC"> <name>PCC_RTC</name> <description>PCC RTC Register</description> <addressOffset>0xF4</addressOffset> <resetValue>0x80000000</resetValue> </register>
            <register derivedFrom="PCCn%s"><dim>0</dim><dimIncrement>0</dimIncrement><dimIndex></dimIndex> <name>PCC_LPTMR0</name> <description>PCC LPTMR0 Register</description> <addressOffset>0x100</addressOffset> </register>
            <register derivedFrom="PCC_FTFC"> <name>PCC_PORTA</name> <description>PCC PORTA Register</description> <addressOffset>0x124</addressOffset> <resetValue>0x80000000</resetValue> </register>
            <register derivedFrom="PCC_FTFC"> <name>PCC_PORTB</name> <description>PCC PORTB Register</description> <addressOffset>0x128</addressOffset> <resetValue>0x80000000</resetValue> </register>
            <register derivedFrom="PCC_FTFC"> <name>PCC_PORTC</name> <description>PCC PORTC Register</description> <addressOffset>0x12C</addressOffset> <resetValue>0x80000000</resetValue> </register>
            <register derivedFrom="PCC_FTFC"> <name>PCC_PORTD</name> <description>PCC PORTD Register</description> <addressOffset>0x130</addressOffset> <resetValue>0x80000000</resetValue> </register>
            <register derivedFrom="PCC_FTFC"> <name>PCC_PORTE</name> <description>PCC PORTE Register</description> <addressOffset>0x134</addressOffset> <resetValue>0x80000000</resetValue> </register>
            <register derivedFrom="PCC_FTM3"> <name>PCC_FlexIO</name> <description>PCC FlexIO Register</description> <addressOffset>0x168</addressOffset> </register>
            <register derivedFrom="PCC_FTFC"> <name>PCC_EWM</name> <description>PCC EWM Register</description> <addressOffset>0x184</addressOffset> <resetValue>0x80000000</resetValue> </register>
            <register derivedFrom="PCC_FTM3"> <name>PCC_LPI2C0</name> <description>PCC LPI2C0 Register</description> <addressOffset>0x198</addressOffset> </register>
            <register derivedFrom="PCC_FTM3"> <name>PCC_LPUART0</name> <description>PCC LPUART0 Register</description> <addressOffset>0x1A8</addressOffset> </register>
            <register derivedFrom="PCC_FTM3"> <name>PCC_LPUART1</name> <description>PCC LPUART1 Register</description> <addressOffset>0x1AC</addressOffset> </register>
            <register derivedFrom="PCC_FTFC"> <name>PCC_CMP0</name> <description>PCC CMP0 Register</description> <addressOffset>0x1CC</addressOffset> <resetValue>0x80000000</resetValue> </register>
         </registers>
      </peripheral>
